#include <stdio.h>;


int main(void)
{
	return 0;
}


	//질문! : 자료형이 뭐에요?
	//대답! : 데이터를 표현하는 기준! (데이터를 표현하는 방법)

	//int -> ??? : 제가 정수를 저장할건데요.. 크기는 4 바이트에요.
	/*
	정수형
	char : 1바이트 : -128 이상 ~ 127 이하
	short : 2바이트 : -32,768 이상 ~ 32,767 이하
	int : 4바이트 : -2,147,483,648 이상 ~ 2,147,483,647 이하
	long : 4바이트 : -2,147,483,648 이상 ~ 2,147,483,647 이하
	long long : 8바이트 : -9,223,372,036,854,775,808 이상 ~ -9,223,372,036,854,775,807 이하
	
	실수형
	float : 4바이트 : +-3.4*10^-37 이상 ~ +-3.4*10^38 이하
	double : 8바이트 : +-1.7*10^-307 이상 ~ +-1.7*10^308 이하
	long double : 8바이트 이상 : double 이상의 표현 범위
	*/
